#language: ru
@all
Функционал: Фильтрация
  Сценарий: Проверка фильтрации телевизоров
    Когда перешел в яндекс маркет
    Когда закрыл диалоговое окно
    Когда выбрал раздел электроника
    Когда выбрал раздел Телевизоры
    Когда выбрал расширенный поиск
    Когда задал параметр поиска от
    Когда выбрал производителей Samsung, LG
    Когда выбрал кнопку применить
    Когда указал количество элементов на странице
    Когда проверил количество элементов на странице
    Когда в поисковую строку ввел запомненное значение
    Когда сравнил полученное с ожидаемым значение




