#language: ru
@all
Функционал: Фильтрация
Сценарий: Проверка фильтрации наушников
Когда перешел в яндекс маркет
Когда закрыл диалоговое окно
Когда выбрал раздел электроника
Когда выбрал раздел Наушники
Когда выбрал расширенный поиск
Когда задал параметр поиска наушников от
Когда выбрал производителей Beats
Когда выбрал кнопку применить
Когда указал вид отображения элементов на странице
Когда проверил количество элементов на странице
Когда в поисковую строку ввел запомненное значение
Когда сравнил полученное с ожидаемым значение наушники